{"class_name": "Functional", "config": {"name": "functional_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 296, 25], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "TCN", "config": {"name": "tcn", "trainable": true, "dtype": "float32", "nb_filters": 65, "kernel_size": 9, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32, 64], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.2, "return_sequences": false, "activation": "relu", "use_batch_norm": false, "use_layer_norm": false, "use_weight_norm": true, "kernel_initializer": "he_normal"}, "name": "tcn", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 7, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["tcn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "activation_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["activation_1", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}